CSI API ETABS v1

# cDConcShellEurocode_2_2004 Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cDConcShellEurocode_2_2004

    Public Interface cDConcShellEurocode_2_2004

    Dim instance As cDConcShellEurocode_2_2004

    public interface class cDConcShellEurocode_2_2004

    type cDConcShellEurocode_2_2004 =  interface end

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com